-- 12_lesson_11_my_solution

-- Практическое задание по теме “Оптимизация запросов”

/*
 1.	Создайте таблицу logs типа Archive. Пусть при каждом создании записи в таблицах users, catalogs 
и products в таблицу logs помещается время и дата создания записи, название таблицы, идентификатор 
первичного ключа и содержимое поля name.*/
-- **************************************************************************************************************



-- 2*.	Создайте SQL-запрос, который помещает в таблицу users миллион записей..
-- **************************************************************************************************************



/*
|product                |product_category |
|-----------------------|-----------------|
|Intel Core i3-8100     |Процессоры       |
|Intel Core i5-7400     |Процессоры       |
|AMD FX-8320E           |Процессоры       |
|AMD FX-8320            |Процессоры       |
|ASUS ROG MAXIMUS X HERO|Материнские платы|
|Gigabyte H310M S2H     |Материнские платы|
|MSI B250M GAMING PRO   |Материнские платы|

*/





-- \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
-- *Практическое задание по теме “NoSQL"

-- 1*.	В базе данных Redis подберите коллекцию для подсчета посещений с определенных IP-адресов..
-- **************************************************************************************************************


/*
2*.	При помощи базы данных Redis решите задачу поиска имени пользователя по электронному 
адресу и наоборот, поиск электронного адреса пользователя по его имени.*/
-- **************************************************************************************************************



-- 3*.	Организуйте хранение категорий и товарных позиций учебной базы данных shop в СУБД MongoDB.
-- **************************************************************************************************************


/*
Комментарии преподавателя:
--------------------------------------
Кирилл Иванов・Преподаватель
